In [ ]:
import pandas as pd
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
df.head(10)

    ano      mes estado    numero    encontro
0  1998  Janeiro   Acre   0 Fires  01-01-1998
1  1999  Janeiro   Acre   0 Fires  01-01-1999
2  2000  Janeiro   Acre   0 Fires  01-01-2000
3  2001  Janeiro   Acre   0 Fires  01-01-2001
4  2002  Janeiro   Acre   0 Fires  01-01-2002
5  2003  Janeiro   Acre  10 Fires  01-01-2003
6  2004  Janeiro   Acre   0 Fires  01-01-2004
7  2005  Janeiro   Acre  12 Fires  01-01-2005
8  2006  Janeiro   Acre   4 Fires  01-01-2006
9  2007  Janeiro   Acre   0 Fires  01-01-2007

In [ ]:
df.tail()

      ano        mes estado numero    encontro
510  2009  Fevereiro  Amapa      0  01-01-2009
511  2010  Fevereiro  Amapa      0  01-01-2010
512  2011  Fevereiro  Amapa      3  01-01-2011
513  2012  Fevereiro  Amapa      5  01-01-2012
514  2013  Fevereiro  Amapa      0  01-01-2013

In [ ]:
df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa'], dtype=object)

Rename Columns

In [ ]:
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)

In [ ]:
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre         0 Fires  01-01-1998
1  1999  Janeiro  Acre         0 Fires  01-01-1999
2  2000  Janeiro  Acre         0 Fires  01-01-2000
3  2001  Janeiro  Acre         0 Fires  01-01-2001
4  2002  Janeiro  Acre         0 Fires  01-01-2002

In [ ]:
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515 entries, 0 to 514
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             515 non-null    int64
 1   month            515 non-null    object
 2   state            515 non-null    object
 3   number_of_fires  510 non-null    object
 4   date             515 non-null    object
dtypes: int64(1), object(4)
memory usage: 20.2+ KB

In [ ]:
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre         0 Fires  01-01-1998
1  1999  Janeiro  Acre         0 Fires  01-01-1999
2  2000  Janeiro  Acre         0 Fires  01-01-2000
3  2001  Janeiro  Acre         0 Fires  01-01-2001
4  2002  Janeiro  Acre         0 Fires  01-01-2002

In [ ]:
new_order =[4,1,0,2,3]
df = df[df.columns[new_order]]
df.head()

  number_of_fires    month        date  year state
0         0 Fires  Janeiro  01-01-1998  1998  Acre
1         0 Fires  Janeiro  01-01-1999  1999  Acre
2         0 Fires  Janeiro  01-01-2000  2000  Acre
3         0 Fires  Janeiro  01-01-2001  2001  Acre
4         0 Fires  Janeiro  01-01-2002  2002  Acre

In [ ]:
df.head(10)

  number_of_fires    month        date  year state
0         0 Fires  Janeiro  01-01-1998  1998  Acre
1         0 Fires  Janeiro  01-01-1999  1999  Acre
2         0 Fires  Janeiro  01-01-2000  2000  Acre
3         0 Fires  Janeiro  01-01-2001  2001  Acre
4         0 Fires  Janeiro  01-01-2002  2002  Acre
5        10 Fires  Janeiro  01-01-2003  2003  Acre
6         0 Fires  Janeiro  01-01-2004  2004  Acre
7        12 Fires  Janeiro  01-01-2005  2005  Acre
8         4 Fires  Janeiro  01-01-2006  2006  Acre
9         0 Fires  Janeiro  01-01-2007  2007  Acre

In [ ]:
df.head(25)

   number_of_fires      month        date  year state
0          0 Fires    Janeiro  01-01-1998  1998  Acre
1          0 Fires    Janeiro  01-01-1999  1999  Acre
2          0 Fires    Janeiro  01-01-2000  2000  Acre
3          0 Fires    Janeiro  01-01-2001  2001  Acre
4          0 Fires    Janeiro  01-01-2002  2002  Acre
5         10 Fires    Janeiro  01-01-2003  2003  Acre
6          0 Fires    Janeiro  01-01-2004  2004  Acre
7         12 Fires    Janeiro  01-01-2005  2005  Acre
8          4 Fires    Janeiro  01-01-2006  2006  Acre
9          0 Fires    Janeiro  01-01-2007  2007  Acre
10         0 Fires    Janeiro  01-01-2008  2008  Acre
11         0 Fires    Janeiro  01-01-2009  2009  Acre
12         1 Fires    Janeiro  01-01-2010  2010  Acre
13         0 Fires    Janeiro  01-01-2011  2011  Acre
14         0 Fires    Janeiro  01-01-2012  2012  Acre
15         0 Fires    Janeiro  01-01-2013  2013  Acre
16         0 Fires    Janeiro  01-01-2014  2014  Acre
17         1 Fires    Janeiro  01-01-2015  2015  Acre
18        12 Fires    Janeiro  01-01-2016  2016  Acre
19         0 Fires    Janeiro  01-01-2017  2017  Acre
20         0 Fires  Fevereiro  01-01-1998  1998  Acre
21         0 Fires  Fevereiro  01-01-1999  1999  Acre
22         0 Fires  Fevereiro  01-01-2000  2000  Acre
23         0 Fires  Fevereiro  01-01-2001  2001  Acre
24         1 Fires  Fevereiro  01-01-2002  2002  Acre

In [ ]:
df.tail()

    number_of_fires      month        date  year  state
510               0  Fevereiro  01-01-2009  2009  Amapa
511               0  Fevereiro  01-01-2010  2010  Amapa
512               3  Fevereiro  01-01-2011  2011  Amapa
513               5  Fevereiro  01-01-2012  2012  Amapa
514               0  Fevereiro  01-01-2013  2013  Amapa

In [ ]:
df.tail(10)

    number_of_fires      month        date  year  state
505               2  Fevereiro  01-01-2004  2004  Amapa
506               1  Fevereiro  01-01-2005  2005  Amapa
507               2  Fevereiro  01-01-2006  2006  Amapa
508               0  Fevereiro  01-01-2007  2007  Amapa
509               0  Fevereiro  01-01-2008  2008  Amapa
510               0  Fevereiro  01-01-2009  2009  Amapa
511               0  Fevereiro  01-01-2010  2010  Amapa
512               3  Fevereiro  01-01-2011  2011  Amapa
513               5  Fevereiro  01-01-2012  2012  Amapa
514               0  Fevereiro  01-01-2013  2013  Amapa

**Determine if the columns contain the numberical data**

In [ ]:
df['number_of_fires'].str.isnumeric()

0      False
1      False
2      False
3      False
4      False
       ...
510     True
511     True
512     True
513     True
514     True
Name: number_of_fires, Length: 515, dtype: object

In [ ]:
df['number_of_fires'].astype(str).str.isdigit()

0      False
1      False
2      False
3      False
4      False
       ...
510     True
511     True
512     True
513     True
514     True
Name: number_of_fires, Length: 515, dtype: bool

In [ ]:
df['number_of_fires'].str.strip("Fires")

0      0
1      0
2      0
3      0
4      0
       ..
510     0
511     0
512     3
513     5
514     0
Name: number_of_fires, Length: 515, dtype: object

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515 entries, 0 to 514
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   number_of_fires  510 non-null    object
 1   month            515 non-null    object
 2   date             515 non-null    object
 3   year             515 non-null    int64
 4   state            515 non-null    object
dtypes: int64(1), object(4)
memory usage: 20.2+ KB

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    5
date               0
dtype: int64

In [ ]:
df = df.dropna()
df = df.reset_index()
df.head()

   index  year    month state number_of_fires        date
0      0  1998  Janeiro  Acre              0   01-01-1998
1      1  1999  Janeiro  Acre              0   01-01-1999
2      2  2000  Janeiro  Acre              0   01-01-2000
3      3  2001  Janeiro  Acre              0   01-01-2001
4      4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [ ]:
df.tail()

     index  year      month  state number_of_fires        date
505    510  2009  Fevereiro  Amapa               0  01-01-2009
506    511  2010  Fevereiro  Amapa               0  01-01-2010
507    512  2011  Fevereiro  Amapa               3  01-01-2011
508    513  2012  Fevereiro  Amapa               5  01-01-2012
509    514  2013  Fevereiro  Amapa               0  01-01-2013

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 510 entries, 0 to 509
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            510 non-null    int64
 1   year             510 non-null    int64
 2   month            510 non-null    object
 3   state            510 non-null    object
 4   number_of_fires  510 non-null    object
 5   date             510 non-null    object
dtypes: int64(2), object(4)
memory usage: 24.0+ KB

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df = df.drop(['month','date'],axis=1)
df.head()

   year state number_of_fires
0  1998  Acre              0
1  1999  Acre              0
2  2000  Acre              0
3  2001  Acre              0
4  2002  Acre              0

In [ ]:
file_name = "/content/amazon_fires.csv"
df = pd.read_csv(file_name,encoding = "ISO-8859-1")
new_columns = {'ano':'year',
               'estado': 'state',
               'mes':'month',
               'numero':'number_of_fires',
               'encontro':'date'}
df.rename(columns=new_columns, inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index  year    month state number_of_fires        date
0      1  1999  Janeiro  Acre              0   01-01-1999
1      2  2000  Janeiro  Acre              0   01-01-2000
2      3  2001  Janeiro  Acre              0   01-01-2001
3      4  2002  Janeiro  Acre              0   01-01-2002
4      5  2003  Janeiro  Acre             10   01-01-2003

In [ ]:
df = df.drop(df.index[[2,3]])
df = df.reset_index()
df.head()

   level_0  index  year    month state number_of_fires        date
0        0      1  1999  Janeiro  Acre              0   01-01-1999
1        1      2  2000  Janeiro  Acre              0   01-01-2000
2        4      5  2003  Janeiro  Acre             10   01-01-2003
3        5      6  2004  Janeiro  Acre              0   01-01-2004
4        6      7  2005  Janeiro  Acre             12   01-01-2005

In [ ]:
df = df.drop(df.index[1:4])
df.head()

    level_0  index  year    month state number_of_fires        date
0         0      1  1999  Janeiro  Acre              0   01-01-1999
7         9     10  2008  Janeiro  Acre              0   01-01-2008
8        10     11  2009  Janeiro  Acre              0   01-01-2009
9        11     12  2010  Janeiro  Acre              1   01-01-2010
10       12     13  2011  Janeiro  Acre              0   01-01-2011